jfx/218/webrev.02/modules/javafx.web/src/main/native/Source/WebCore/dom/MutationEvent.cpp.patch
diff a/modules/javafx.web/src/main/native/Source/WebCore/dom/MutationEvent.cpp b/modules/javafx.web/src/main/native/Source/WebCore/dom/MutationEvent.cpp
--- a/modules/javafx.web/src/main/native/Source/WebCore/dom/MutationEvent.cpp
+++ b/modules/javafx.web/src/main/native/Source/WebCore/dom/MutationEvent.cpp
@@ -21,12 +21,16 @@
  */
 
 #include "config.h"
 #include "MutationEvent.h"
 
+#include <wtf/IsoMallocInlines.h>
+
 namespace WebCore {
 
+WTF_MAKE_ISO_ALLOCATED_IMPL(MutationEvent);
+
 MutationEvent::MutationEvent(const AtomString& type, CanBubble canBubble, IsCancelable cancelable, Node* relatedNode, const String& prevValue, const String& newValue)
     : Event(type, canBubble, cancelable)
     , m_relatedNode(relatedNode)
     , m_prevValue(prevValue)
     , m_newValue(newValue)
