jfx/263/webrev.00/modules/javafx.web/src/main/native/Source/WebCore/dom/MutationObserverRegistration.cpp.patch
diff a/modules/javafx.web/src/main/native/Source/WebCore/dom/MutationObserverRegistration.cpp b/modules/javafx.web/src/main/native/Source/WebCore/dom/MutationObserverRegistration.cpp
--- a/modules/javafx.web/src/main/native/Source/WebCore/dom/MutationObserverRegistration.cpp
+++ b/modules/javafx.web/src/main/native/Source/WebCore/dom/MutationObserverRegistration.cpp
@@ -63,11 +63,11 @@
 {
     if (!isSubtree())
         return;
 
     node.registerTransientMutationObserver(*this);
-    m_observer->setHasTransientRegistration();
+    m_observer->setHasTransientRegistration(node.document());
 
     if (!m_transientRegistrationNodes) {
         m_transientRegistrationNodes = makeUnique<HashSet<GCReachableRef<Node>>>();
 
         ASSERT(!m_nodeKeptAlive);
