jfx/91/webrev.00/modules/javafx.web/src/main/native/Source/WebCore/dom/MutationObserverInterestGroup.cpp.patch
diff a/modules/javafx.web/src/main/native/Source/WebCore/dom/MutationObserverInterestGroup.cpp b/modules/javafx.web/src/main/native/Source/WebCore/dom/MutationObserverInterestGroup.cpp
--- a/modules/javafx.web/src/main/native/Source/WebCore/dom/MutationObserverInterestGroup.cpp
+++ b/modules/javafx.web/src/main/native/Source/WebCore/dom/MutationObserverInterestGroup.cpp
@@ -49,11 +49,11 @@
     ASSERT((type == MutationObserver::Attributes && attributeName) || !attributeName);
     auto observers = target.registeredMutationObservers(type, attributeName);
     if (observers.isEmpty())
         return nullptr;
 
-    return std::make_unique<MutationObserverInterestGroup>(WTFMove(observers), oldValueFlag);
+    return makeUnique<MutationObserverInterestGroup>(WTFMove(observers), oldValueFlag);
 }
 
 bool MutationObserverInterestGroup::isOldValueRequested() const
 {
     for (auto options : m_observers.values()) {
